Repository: yaolin-dev/OKVideoMac
Catalog: OKVideoMac/macOS/OKVideoMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# configuration.action.source-mismatch
source: The configuration interface does not match the current action. Try again.
zh_hans: 配置界面来源与当前操作不匹配，请重试。

# configuration.action.waiting-interface
source: Waiting for the provider to open the next action screen…
zh_hans: 正在等待站点创建下一步操作界面…

# configuration.actions.close-note
source: Closing returns to the previous content page and browsing position.
zh_hans: 关闭后会回到原来的内容页和浏览位置。

# configuration.actions.empty
source: This configuration category did not return any available actions.
zh_hans: 该配置分类没有返回可执行操作。

# configuration.actions.loading
source: Loading configuration actions…
zh_hans: 正在读取当前配置操作…

# configuration.activate
source: Use This Provider
zh_hans: 使用此片源

# configuration.active
source: In Use
zh_hans: 正在使用

# configuration.base-url.optional
source: Relative Resource Base URL (Optional)
zh_hans: 相对资源基准 URL（可选）

# configuration.bridge.unresponsive
source: The local configuration bridge repeatedly failed to respond. Try the action again.
zh_hans: 本机配置桥连续无法响应，请重试该操作。

# configuration.catpaw-selection.failed
source: Unable to Select CatPaw Configuration
zh_hans: 无法选择 CatPaw 配置

# configuration.catpaw.enable-first
source: Enable a CatPawOpen Node configuration first.
zh_hans: 请先启用一个 CatPawOpen Node 配置。

# configuration.catpaw.import.failed
source: Unable to Import CatPaw Configuration
zh_hans: 无法导入 CatPaw 配置

# configuration.catpaw.imported.message
source: Dynamic provider directories were reloaded with the new profile. No restart is required.
zh_hans: 动态站点目录已按新 profile 重新加载，无需重启应用。

# configuration.catpaw.imported.title
source: CatPaw Configuration Imported
zh_hans: CatPaw 配置已导入

source: Configuration Center
zh_hans: 配置中心

# configuration.choose-file
source: Choose Video Provider Configuration File
zh_hans: 选择点播配置文件

# configuration.choose-file.subtitle
source: Import JSON or text configuration from this Mac
zh_hans: 从本机导入 JSON 或文本配置

# configuration.choose-file.title
source: Choose a Configuration File
zh_hans: 选择配置文件

# configuration.delete.failed
source: Configuration Deletion Failed
zh_hans: 删除配置失败

# configuration.delete.message
source: Favorites and history will not be deleted with the configuration.
zh_hans: 收藏和历史不会随配置删除。

# configuration.delete.title
source: Delete “%@”?
zh_hans: 删除“%@”？

# configuration.empty.message
source: Video provider configurations are managed here. Add Live TV sources separately in Settings → Live TV Sources.
zh_hans: 这里仅管理点播配置；直播源请到“设置 → 直播源”单独添加。

# configuration.empty.title
source: No Video Provider Configurations
zh_hans: 没有点播配置

# configuration.export.failed
source: Export Failed
zh_hans: 导出失败

# configuration.export.failed-message
source: Unable to export configuration: %@
zh_hans: 无法导出配置：%@

# configuration.file-selection.failed
source: Unable to Select File
zh_hans: 无法选择文件

# configuration.import
source: Add Provider
zh_hans: 添加片源

# configuration.import-catpaw
source: Import CatPaw Configuration
zh_hans: 导入 CatPaw 配置

# configuration.import-catpaw.subtitle
source: Choose test0.db.json. Accounts and mounts are written only to the protected runtime profile.
zh_hans: 选择 test0.db.json；账号与挂载只写入受保护的运行 profile

# configuration.import-enable-first
source: Import and enable a video provider configuration first.
zh_hans: 请先导入并启用一个点播配置。

# configuration.import-update.section
source: Import & Update
zh_hans: 导入与更新

# configuration.import.action
source: Import…
zh_hans: 导入…

# configuration.import.action-short
source: Import
zh_hans: 导入

# configuration.import.android-unavailable
source: %d sites need the Android compatibility component. You will be guided to install it when needed.
zh_hans: 其中 %d 个站点需要 Android 兼容组件，使用时会引导你安装。

source: Configuration Import Failed
zh_hans: 配置导入失败

# configuration.import.formats
source: Supports JSON, limited JSONC, image, and Base64-wrapped formats. You can sync included Live TV lists after import.
zh_hans: 支持 JSON、有限 JSONC、图片或 Base64 包装格式；完成后可选择同步其中的直播列表。

# configuration.import.in-progress
source: Another configuration is already being imported. Wait for it to finish.
zh_hans: 已有配置正在导入，请稍候

# configuration.import.subtitle
source: Import a video provider configuration from a URL or pasted content.
zh_hans: 通过 URL 或粘贴内容导入点播配置。

# configuration.import.success
source: Provider Added
zh_hans: 片源已添加

# configuration.imported.empty
source: No video provider configurations yet. Import one above.
zh_hans: 还没有点播配置，可先从上方导入。

# configuration.imported.section
source: My Providers
zh_hans: 我的片源

# configuration.importing
source: Importing
zh_hans: 导入中

# configuration.name.optional
source: Provider Name (Optional)
zh_hans: 片源名称（选填）

# configuration.page.updated
source: The configuration page was updated. Open it again.
zh_hans: 配置页面已更新，请重新打开

# configuration.refresh-current
source: Refresh Current Video Provider Configuration
zh_hans: 刷新当前点播配置

source: Configuration Refresh Failed
zh_hans: 配置刷新失败

# configuration.refresh.remote-only
source: Only URL configurations can be refreshed directly
zh_hans: 只有 URL 配置可以直接刷新

# configuration.refresh.subtitle
source: Download and load the current remote configuration again
zh_hans: 重新下载并载入当前远程配置

# configuration.refresh.title
source: Refresh Current Configuration
zh_hans: 刷新当前配置

# configuration.remote.security-note
source: Standard configurations allow HTTP and HTTPS. HTTPS is recommended for remote Node bundles. For an HTTP bundle, append #sha256=<64-character hash> to the .js.md5 URL; &source=<source ID>&version=<version> are optional.
zh_hans: 普通配置允许 HTTP/HTTPS。远程 Node bundle 建议 HTTPS；最终为 HTTP 时需在 .js.md5 地址后附 #sha256=<64位哈希>，可再附 &source=<源ID>&version=<版本>。

# configuration.source.local-file
source: Local File
zh_hans: 本地文件

# configuration.source.pasted
source: Pasted Content
zh_hans: 粘贴内容

# configuration.source.remote-url
source: Remote URL
zh_hans: 远程 URL

# configuration.stage.activating
source: Activating configuration…
zh_hans: 正在启用配置…

# configuration.stage.download-parse
source: Downloading and parsing…
zh_hans: 正在下载并解析…

# configuration.stage.parsing
source: Parsing configuration…
zh_hans: 正在解析配置…

# configuration.stage.saving
source: Saving configuration…
zh_hans: 正在保存配置…

# configuration.stage.starting-node
source: Starting Node Runtime…
zh_hans: 正在启动 Node Runtime…

source: Configuration Switch Failed
zh_hans: 切换配置失败

# configuration.sync-live
source: Sync Live TV Sources
zh_hans: 同步直播源

# configuration.syncing
source: Syncing
zh_hans: 正在同步

# app.environment.not-initialized
source: The app environment has not been initialized
zh_hans: 应用环境尚未初始化

# app.environment.uninitialized
source: The application environment has not been initialized.
zh_hans: 应用环境尚未初始化

# app.initialization.failed
source: Unable to Initialize App
zh_hans: 无法初始化应用

# app.instance.database-lock.failed
source: Unable to lock the application database
zh_hans: 无法锁定应用数据库

# app.instance.lock-create.failed
source: Unable to create the application instance lock
zh_hans: 无法创建应用实例锁

# app.startup.failed
source: Startup Failed
zh_hans: 启动失败

# backup.error.checksum
source: Backup verification failed. The file may be damaged or modified.
zh_hans: 备份文件校验失败，文件可能已损坏或被修改

# backup.error.invalid-configuration
source: The VOD configuration in the backup is incomplete or failed validation.
zh_hans: 备份中的点播配置不完整或校验失败

# backup.error.invalid-document
source: This is not a valid OKVideoMac backup file.
zh_hans: 这不是有效的 OKVideoMac 备份文件

# backup.error.invalid-history
source: The history in the backup is incomplete or contains unsafe fields.
zh_hans: 备份中的历史记录不完整或包含不安全字段

# backup.error.too-large
source: The backup file exceeds the allowed size.
zh_hans: 备份文件超过允许的大小

# backup.error.unsupported-format
source: The backup file format is unsupported.
zh_hans: 备份文件格式不受支持

# backup.error.unsupported-schema
source: Backup schema version %lld is newer than this app supports.
zh_hans: 备份格式版本 %lld 高于当前应用支持的版本

# backup.safety-create.failed
source: Unable to create a safety backup before import: %@
zh_hans: 无法创建导入前安全备份：%@

# category.load.failed
source: Category Loading Failed
zh_hans: 分类加载失败

# cloud.android-surface.accessibility
source: Provider Android Configuration Interface
zh_hans: 站点 Android 配置界面

# cloud.android-surface.hint
source: Click or drag to interact; use the button below to go back one level
zh_hans: 点击或拖动以操作；下方按钮可返回上一层

# cloud.android-surface.note
source: This is the provider's native Android interface. Click or drag to interact.
zh_hans: 这是站点原生 Android 界面，可直接点击或拖动。

# cloud.android-surface.unavailable
source: Android configuration screen temporarily unavailable
zh_hans: Android 配置画面暂时不可用

# cloud.android.complete
source: Complete the action in the native Android interface
zh_hans: 请在 Android 原生界面中完成操作

# cloud.android.complete-and-refresh
source: Complete the action in the native Android interface, then select Finish and Refresh.
zh_hans: 请在 Android 原生界面中完成操作，完成后点击“完成并刷新”。

# cloud.android.interface-waiting
source: The Android action interface is temporarily hidden while the provider processes the request…
zh_hans: Android 操作界面暂时不可见，正在等待站点处理…

# cloud.android.method-returned
source: The provider method returned. After confirming the Android action is complete, select Finish and Refresh.
zh_hans: 站点方法已返回；确认 Android 操作完成后，请点击“完成并刷新”。

# cloud.android.waiting
source: Waiting for the provider to create the Android action interface…
zh_hans: 正在等待站点创建 Android 操作界面…

# cloud.authorization.already-verified
source: This playback request was already verified automatically once. To avoid duplicate transfers, confirm the status and retry manually.
zh_hans: 本次播放已经自动验证过一次；为避免重复转存，请确认后手动重试。

# cloud.authorization.auto-resume-used
source: Automatic resume has already run once. Confirm authorization, then retry manually.
zh_hans: 自动续播已执行过一次，请确认授权状态后手动重试。

source: Cloud Authorization Cancelled
zh_hans: 已取消网盘授权

# cloud.authorization.completed
source: Authorization Complete
zh_hans: 授权已完成

# cloud.authorization.incomplete
source: Authorization Incomplete
zh_hans: 授权尚未完成

# cloud.authorization.no-media
source: Authorization finished, but the original playback request returned no media. Try playback again.
zh_hans: 授权流程已结束，但原播放请求没有返回媒体，请重试播放。

# cloud.authorization.not-verified
source: Authorization could not be verified. The configuration page will remain open; finish authorization and try again.
zh_hans: 授权验证尚未通过，配置页将保持打开，请完成授权后再试。

# cloud.authorization.playback-resuming
source: Authorization successful. Resuming playback…
zh_hans: 授权成功，正在继续播放…

# cloud.authorization.refreshing
source: Refreshing authorization and resolving the current content again…
zh_hans: 正在刷新授权状态并重新解析当前内容…

# cloud.authorization.resuming
source: Authorization complete. Resuming playback…
zh_hans: 已检测到授权完成，正在恢复当前播放…

# cloud.authorization.signal-received
source: Authorization confirmation received. To avoid repeating the cloud operation, retry manually.
zh_hans: 已收到授权完成信号；为避免重复执行网盘操作，请手动重试。

# cloud.authorization.title
source: Cloud Authorization
zh_hans: 网盘授权

# cloud.authorization.verification-failed
source: Authorization verification failed: %@
zh_hans: 授权验证未通过：%@)

# cloud.authorization.waiting-request
source: Waiting for authorization confirmation that matches the current playback request.
zh_hans: 等待与当前播放请求匹配的授权完成信号。

# cloud.authorization.waiting-save
source: Waiting for the configuration to be saved. The current title will be verified automatically only once.
zh_hans: 等待配置保存；保存后只会自动验证当前影片一次。

# cloud.complete-refresh
source: Finish and Refresh
zh_hans: 完成并刷新

# cloud.configuration-action.completed
source: Configuration Action Complete
zh_hans: 配置操作已完成

# cloud.configuration-action.incomplete
source: Configuration Action Incomplete
zh_hans: 配置操作尚未完成

# cloud.configuration-action.title
source: Configuration Action
zh_hans: 配置操作

source: Cloud Configuration Center
zh_hans: 网盘配置中心

# cloud.configuration.confirming
source: Confirming the result and refreshing configuration…
zh_hans: 正在确认操作结果并刷新配置…

# cloud.configuration.keep-open
source: The configuration page will remain open. After saving, apply it manually and try the original action again.
zh_hans: 配置页会保持打开；保存后可手动应用并重试原操作。

# cloud.lifecycle.submitting-action
source: Submitting the current action
zh_hans: 正在提交当前操作

# cloud.lifecycle.submitting-command
source: Submitting configuration command
zh_hans: 正在提交配置命令

# cloud.lifecycle.waiting-interface
source: Waiting for the next action screen
zh_hans: 正在等待下一步操作界面

# cloud.lifecycle.waiting-provider
source: Waiting for provider confirmation
zh_hans: 正在等待站点确认结果

# cloud.text-entry.collapse
source: Hide Text Entry
zh_hans: 收起输入

# cloud.text-entry.placeholder
source: Click an Android text field, then send text from here
zh_hans: 点击 Android 输入框后，可在这里发送文字

# cloud.text-entry.send
source: Send Text
zh_hans: 发送文字

# cloud.text-entry.show
source: Enter Text
zh_hans: 输入文字

# common.action.failed
source: %@ Failed
zh_hans: %@失败

# common.all
source: All
zh_hans: 全部

# common.automatic
source: Automatic
zh_hans: 自动

# common.back
source: Back
zh_hans: 返回

# common.back-one-level
source: Back One Level
zh_hans: 返回上一层

# common.back-previous
source: Back to the previous page
zh_hans: 返回上一页

# common.choose
source: Choose…
zh_hans: 选择…

# common.clear
source: Clear
zh_hans: 清空

# common.collapse
source: Show Less
zh_hans: 收起

# common.configuration
source: Configuration
zh_hans: 配置

# common.copied
source: Copied
zh_hans: 已复制

# common.export
source: Export
zh_hans: 导出

# common.folder
source: Folder
zh_hans: 目录

# common.invert-selection
source: Invert Selection
zh_hans: 反选

# common.method
source: Method
zh_hans: 方式

# common.not-selected
source: Not Selected
zh_hans: 未选择

# common.other
source: Other
zh_hans: 其他

# common.pause
source: Pause
zh_hans: 暂停

# common.play
source: Play
zh_hans: 播放

# common.provider
source: Provider
zh_hans: 站点

# common.refresh
source: Refresh
zh_hans: 刷新

# common.refresh.failed
source: Unable to Refresh
zh_hans: 无法刷新

# common.reload
source: Reload
zh_hans: 重新加载

# common.reset
source: Reset
zh_hans: 重置

# common.restore-default
source: Restore Defaults
zh_hans: 恢复默认

# live.guide.inactive
source: Programme guide is not loading.
zh_hans: 节目单加载已停止

# common.retry
source: Try Again
zh_hans: 重试

# common.save
source: Save
zh_hans: 保存

# common.sort
source: Sort
zh_hans: 排序

# common.status
source: Status
zh_hans: 状态

# common.unknown
source: Unknown
zh_hans: 未知

# common.unknown-error
source: Unknown error
zh_hans: 未知错误

# common.updating
source: Updating…
zh_hans: 正在更新…

# android.capability.cannot-create-repair
source: Unable to create or repair
zh_hans: 无法创建或修复

# android.capability.cannot-launch
source: Unable to launch
zh_hans: 无法启动

# android.capability.create-repair-ready
source: The dedicated Android environment can be created or repaired.
zh_hans: 可以创建或修复专用 Android 环境

# android.capability.launch-ready
source: The existing dedicated Android environment is ready to launch.
zh_hans: 现有专用 Android 环境可直接启动

# android.capability.not-created
source: The dedicated Android environment has not been created.
zh_hans: 尚未创建专用 Android 环境

# android.coordinator.avd-incompatible
source: The dedicated Android environment is incompatible with the current runtime (%@). To protect sign-in data, it was not deleted or rebuilt automatically.
zh_hans: 专用 Android 环境与当前运行环境不兼容（%@）。为保护登录数据，未自动删除或重建。

# android.coordinator.external-not-configured
source: No existing Android SDK has been selected.
zh_hans: 尚未选择现有 Android SDK

# android.coordinator.external-unavailable
source: The existing Android SDK is unavailable: %@
zh_hans: 现有 Android SDK 当前不可用：%@

# android.coordinator.managed-unavailable
source: The OKVideoMac-managed Android environment is unavailable.
zh_hans: OKVideoMac 托管 Android 环境当前不可用

# android.coordinator.must-stop
source: Stop the Android compatibility module before switching runtimes.
zh_hans: 切换 Android 运行环境前，请先停止当前 Android 兼容模块

# android.coordinator.selection-changed
source: The Android runtime selection changed. Try again.
zh_hans: Android 运行环境选择已变化，请重试

# android.external.issue.avd-config-unreadable
source: The system image configuration for the OKVideoMac Android environment could not be read.
zh_hans: OKVideoMac 专用 Android 环境的 system image 配置无法读取

# android.external.issue.avd-image-mismatch
source: The dedicated Android environment's API, ABI, or tag does not match the system image metadata.
zh_hans: 专用 Android 环境的 API、ABI、tag 与 system image 元数据不一致

# android.external.issue.avd-image-missing
source: The system image used by the dedicated Android environment is not present in the selected SDK.
zh_hans: 专用 Android 环境引用的 system image 不在所选 SDK 中

# android.external.issue.avd-incompatible
source: The dedicated Android environment is incompatible with the existing SDK (%@). userdata was not modified.
zh_hans: 专用 Android 环境与现有 SDK 不兼容（%@）；未修改 userdata

# android.external.issue.avd-incomplete
source: The OKVideoMac Android environment folder is incomplete. Existing data was not overwritten.
zh_hans: OKVideoMac 专用 Android 环境目录不完整；未自动覆盖现有数据

# android.external.issue.avdmanager-required
source: avdmanager is required to create or repair the dedicated Android environment.
zh_hans: 创建或修复专用 Android 环境需要 avdmanager

# android.dex-cache.cancelled
source: The plugin download was cancelled.
zh_hans: 插件下载已取消。

# android.dex-cache.download
source: The plugin download was interrupted. Check the connection and try again.
zh_hans: 插件下载中断，请检查网络后重试。

# android.dex-cache.integrity
source: The downloaded plugin did not pass verification. Try again later.
zh_hans: 下载的插件未通过校验，请稍后重试。

# android.dex-cache.write
source: The local plugin cache could not be updated. Try again.
zh_hans: 本地插件缓存无法更新，请重试。

# android.external.issue.java-required
source: A Java Runtime is required to create or repair the dedicated Android environment.
zh_hans: 创建或修复专用 Android 环境需要 Java Runtime

# android.external.issue.sdk-folder-missing
source: The previously configured Android SDK folder no longer exists.
zh_hans: 以前配置的 Android SDK 文件夹已不存在

# android.external.issue.system-image-missing
source: The selected SDK has no usable arm64 Android system image.
zh_hans: 所选 SDK 没有可用的 arm64 Android system image

# android.external.issue.tool-architecture
source: %@ in the selected SDK does not support this Mac's architecture.
zh_hans: 所选 SDK 的 %@ 不支持当前 Mac 架构

# android.external.issue.tool-missing
source: The selected SDK is missing %@.
zh_hans: 所选 SDK 缺少 %@

# android.external.issue.tool-not-executable
source: %@ in the selected SDK is not executable.
zh_hans: 所选 SDK 的 %@ 没有执行权限

# android.external.status.create-on-start
source: Available; a dedicated Android environment will be created on first launch.
zh_hans: 可用；首次启动时将创建专用 Android 环境

# android.external.status.ready
source: Available; the existing dedicated Android environment can start directly.
zh_hans: 可用；可以直接启动现有专用 Android 环境

# android.external.status.rebuild-required
source: The SDK is available, but the existing dedicated Android environment is incompatible. After switching, explicitly choose Back Up and Rebuild.
zh_hans: SDK 可用，但现有专用 Android 环境不兼容；切换后需要由用户明确执行备份并重建

# android.external.status.unavailable
source: The existing Android SDK configuration is unavailable.
zh_hans: 现有 Android SDK 配置不可用

# android.failure.adb-device-missing
source: Android Emulator is still running, but ADB did not find the target device.
zh_hans: Android Emulator 仍在运行，但 ADB 未发现目标设备。

# android.failure.adb-offline
source: ADB found the dedicated Android Emulator, but the device remained offline.
zh_hans: ADB 已发现专用 Android Emulator，但设备一直处于 offline 状态。

# android.failure.adb-reconnect
source: The bounded ADB reconnect for the dedicated Android Emulator failed.
zh_hans: 专用 Android Emulator 的有界 ADB 重连失败。

# android.failure.adb-unavailable
source: ADB is unavailable, so the dedicated Android Emulator cannot be connected.
zh_hans: ADB 无法使用，无法连接专用 Android Emulator。

# android.failure.avd-rebuild
source: The dedicated Android Runtime could not start with hardware or software rendering. Rebuild the Runtime in Settings.
zh_hans: 专用 Android Runtime 使用硬件和软件渲染均无法启动；请在设置中重建 Runtime。

# android.failure.boot-timeout
source: Android startup timed out before the compatibility environment became ready.
zh_hans: Android 系统启动超时，兼容环境没有在预期时间内完成启动。

# android.failure.bridge-identity
source: The detected Android Bridge does not belong to this launch instance. The connection was rejected; restart the compatibility environment.
zh_hans: 检测到的 Android Bridge 不属于当前启动实例；已拒绝连接，请重新启动兼容环境。

# android.failure.bridge-install
source: Android Bridge installation failed. Reinstall the app or export diagnostics.
zh_hans: Android Bridge 安装失败，请重新安装测试版或导出诊断。

# android.failure.bridge-launch
source: Android Bridge failed to start. Use Repair, then try again.
zh_hans: Android Bridge 服务启动失败，请使用“修复”后重试。

# android.failure.bridge-timeout
source: Android Bridge did not connect in time. Startup failed; try again or use Repair.
zh_hans: Android Bridge 未在限定时间内建立连接；本次启动已失败，请重试或使用“修复”。

# android.failure.bridge-version
source: Android Bridge does not match this app version. Use Repair to reinstall the current Bridge.
zh_hans: Android Bridge 与当前 App 版本不一致；请使用“修复”重新安装当前 Bridge。

# android.failure.cancelled
source: Android Emulator startup was cancelled or ended by the app.
zh_hans: Android Emulator 启动已由 App 取消或结束。

# android.failure.emulator-launch
source: Android Emulator did not start normally. Export diagnostics, then try again.
zh_hans: Android Emulator 未能正常启动，请导出诊断后重试。

# android.failure.host-port
source: The local Android Bridge port is in use. Close the conflicting app and try again.
zh_hans: 本机 Android Bridge 端口被占用，请关闭冲突程序后重试。

# android.failure.java-missing
source: A Java Runtime is required to create the dedicated Android environment. Install a JDK or Android Studio with JBR.
zh_hans: 创建专用 Android 环境需要 Java Runtime。请安装 JDK，或安装包含 JBR 的 Android Studio。

# android.failure.network
source: Android Emulator did not establish a usable network. Check your network and try again.
zh_hans: Android Emulator 没有建立可用网络，请检查网络后重试。

# android.failure.ownership
source: The dedicated Android Emulator could not be identified safely. No other devices were modified.
zh_hans: 无法安全确认专用 Android Emulator，已停止操作其他设备。

# android.failure.port-conflict
source: A port required by Android Emulator is in use. The occupying process was not terminated.
zh_hans: Android Emulator 所需端口被其他进程占用，未终止占用进程。

# android.failure.port-forward
source: ADB port mapping failed, so Android Bridge cannot connect to the Mac.
zh_hans: ADB 端口映射失败，Android Bridge 无法连接到 Mac。

# android.failure.private-adb
source: OKVideoMac could not start its isolated ADB service. The system ADB service was not connected or stopped.
zh_hans: OKVideoMac 无法启动独立的 ADB 服务；没有连接或关闭系统默认 ADB。

# android.failure.process-mismatch
source: The Android Emulator PID no longer belongs to this launch instance.
zh_hans: Android Emulator PID 已不再属于本次启动实例。

# android.failure.runtime-conflict
source: Another Emulator is using the dedicated AVD or recorded port. No action was taken.
zh_hans: 检测到其他 Emulator 正在使用专用 AVD 或记录端口，未执行任何操作。

# android.failure.sdk-incomplete
source: The Android SDK is incomplete. In Settings, choose an SDK containing ADB, Emulator, and a system image.
zh_hans: Android SDK 不完整，请在设置中选择包含 ADB、Emulator 和系统镜像的 SDK。

# android.failure.title
source: Android Compatibility Environment Failed to Start
zh_hans: Android 兼容环境启动失败

# android.failure.unexpected-device
source: ADB found another Emulator but not the device expected for this launch.
zh_hans: ADB 发现了其他 Emulator，但没有发现本次启动所预期的设备。

# android.failure.unknown
source: The Android compatibility environment failed to start. Export diagnostics now.
zh_hans: Android 兼容环境启动失败，请立即导出诊断信息。

# android.mode.external
source: Existing Android SDK
zh_hans: 现有 Android SDK

# android.mode.managed
source: Managed by OKVideoMac
zh_hans: OKVideoMac 自动管理
